guestbook/app/controllers/entries_controller.rb

  def sign_in
    @name = params[:visitor_name]
    if !@name.blank?
      @entry = Entry.create({:name => @name})
    end

    @entries = Entry.find(:all)
---
INSERT INTO "entries" ("name", "created_at", "updated_at") VALUES('Patrick John Proctor', '2010-04-02 07:03:22', '2010-04-02 07:03:22')
SELECT * FROM "entries" WHERE (name != NULL)